# -*- coding: utf-8 -*-
"""
Created on Tue Nov 16 18:56:21 2021

@author: Администратор
"""

group1=[['Петров И.И.', 'муж.', 'Россия', 'Пермь', 1971, 165, 75, 'инженер'],
        ['Зотов К.С.', 'муж.', 'Россия', 'Лысьва', 1995, 174, 80, 'техник'],
        ['Иванова П.П.', 'жен.', 'Россия', 'Сызрань', 1970, 170, 55, 'специалист'],
        ['Соколов М.М.', 'муж.', 'Россия', 'Пермь', 1976, 187, 84, 'начальник']]


def old():
    старший_сотрудник = group1[0][4]
    for x in range(1, len(group1)):
            if group1[x][4] < старший_сотрудник:
                старший_сотрудник = group1[x][4]                          
                name=group1[x][0]
    print("самый возрастной:", name, "год рождения:", старший_сотрудник)

old()


group2={'Петров': {'пол':'муж.', 'страна':'Россия', 'город':'Пермь', 'г.р.':1965, 'рост':165, 'вес':75, 'должность':'инженер',
          'доход по годам':{'2019':500, '2020':450,"2021":600}},
          'Зотов К.С.': {'пол':'муж.', 'страна':'Россия', 'город':'Лысьва', 'г.р.':1995, 'рост':174, 'вес':80, 'должность':'техник',
          'доход по годам':{'2019':300, '2020':250,"2021":400}},
          'Иванова П.П.': {'пол':'жен.', 'страна':'Россия', 'город':'Сызрань', 'г.р.':1955, 'рост':170, 'вес':55, 'должность':'специалист',
          'доход по годам':{'2019':550, '2020':550,"2021":550}},
          'Соколов М.М.': {'пол':'муж.', 'страна':'Россия', 'город':'Пермь', 'г.р.':1986, 'рост':187, 'вес':84, 'должность':'начальник',
          'доход по годам':{'2019':800, '2020':850,"2021":800}}}

def high():
    высокий = group2['Петров']['рост']
    for key in group2:
        if group2[key]['рост'] > высокий:
            высокий = group2[key]['рост']
    print("самый высокий:", key,"рост:", высокий)

high()


def compare(S1, S2):
    # S1, S2 = [s.lower() for s [S1, S2]]
    ngrams = [S1[i:i+3] for i in range(len(S1))]
    count = 0
    for ngram in ngrams:
        count += S2.count(ngram)
    return count/max(len(S1), len(S2))


S1 = group1[0][0]
S2 = group1[1][0]
c = compare (S1, S2)

print (c, S1, S2)

