исходная_строка="axxlkxsasad dxaxx poaxthxx"
новая_строка = ""
for x in исходная_строка:
    if x == "x":
        новая_строка += "y"
    else:
        новая_строка += x
print(исходная_строка)
print(новая_строка)

числа = [1,2,3,4,5,6,5,4,3,4,5,6,7]
произведение = 1
for x in числа:
    произведение *= x
print(произведение)



числа = [1,2,3,4,5,6,5,4,4,4,5,3,7]
произведение = 1
for x in числа:
    if x//5 == x/5:
        произведение *= x
print(произведение)



числа = [1,2,3,4,5,7,15,4,4,4,7,9,7]
произведение3 = 1
for x in числа:
    if x//3 == x/3:
        произведение3 *= x
произведение5 = 1
for x in числа:
    if x//5 == x/5:
        произведение5 *= x
произведение = произведение3 * произведение5
print(произведение)


числа = [1,2,3,4,5,6,15,4,4,4,5,3,7]
произведение = 1
for x in числа:
    if (x//5 == x/5 and x//3 == x/3):
        произведение *= x
print(произведение)


str="axxlkxsasad dxaxx poaxthxx"
исходная_строка = str.replace("x", "y")
print(исходная_строка)